'''汉化通用函数'''

套路 _关键词参数中转英(中文关键词, 关键词字典, 值字典=空):
    '''将关键词参数 (**关键词参数/**kwags 之类) 中的汉化键/值转换回英文键/值'''
    英文关键词 = {}
    如果 值字典 是 空:
        取 键, 值 于 中文关键词.项々():
            英文关键词[关键词字典.获取(键, 键)] = 值
    否则:
        取 键, 值 于 中文关键词.项々():
            如果 是实例(值, 字符串型):
                英文关键词[关键词字典.获取(键, 键)] = 值字典.获取(值, 值)
            否则:
                英文关键词[关键词字典.获取(键, 键)] = 值
    返回 英文关键词

套路 _星号参数中转英(参数, 参数字典):
    '''将星号参数 (*参数/*args) 中的中文转换回英文'''
    如果 参数:
        参数列表 = []
        取 元素 于 参数:
            元素 = 参数字典.获取(元素, 元素)
            参数列表.追加(元素)
        参数 = 元组型(参数列表)
    返回 参数