# -*- coding:utf-8 -*-
'''
----------------------------------------------------------------
__Author__ : Gemini
__Project__ : package_demo
__File__ : __init__.py.py
__Time__ : '2022/1/25 10:03 PM'
----------------------------------------------------------------
___code is far away from bugs with the god animal protecting___
              ┏┓      ┏┓
            ┏┛┻━━━┛┻┓
            ┃        ┃
            ┃  ┳┛  ┗┳  ┃
            ┃      ┻      ┃
            ┗━┓      ┏━┛
                ┃      ┗━━━┓
                ┃  神兽保佑    ┣┓
                ┃　永无BUG！   ┏┛
                ┗┓┓┏━┳┓┏┛
                  ┃┫┫  ┃┫┫
                  ┗┻┛  ┗┻┛


'''
