from pyclbr import Class
import sys
from types import ModuleType
# Кек

# Нужно для классов
class пацанский_класс:
    def __init__(self):
        self.__диг__ = self.__пися__ = self.__dict__
        self.__пояснение__ = self.__док__ = self.__doc__
        self.__модуль__ = self.__module__
        self.__del__ = self.__маслина__
        self.__add__ = self.__трах__

        self.__init__= self.__инит__
        self.__инит__()
        

    def __инит__(self):
        print("Сука не так блять писать!")

    def __маслина__(self):
        pass

    def __трах__(self):
        pass

def пацанская_функция(fn):
    fn.__класс__ = fn.__class__
    fn.__аннотация__ = fn.__annotations__
    fn.__коде__ = fn.__хуйня__ = fn.__code__
    fn.__пояснение__ = fn.__док__ = fn.__doc__

    return fn
    
def класс_пацан(cl) -> Class:
    cl.__диг__ = cl.__пися__ = cl.__dict__
    cl.__пояснение__ = cl.__док__ = cl.__doc__
    cl.__модуль__ = cl.__module__
    cl.__del__ = cl.__маслина__
    cl.__add__ = cl.__трах__
    cl.__init__= cl.__инит__
    
    return cl

__дорога__ = __где_я__ = __падик__ = __файл__ = __я__ = __file__
__имя__ = __кликуха__ = __наме__ = __name__
версион = др = возраст = sys.version

правда = базаришь = тру = True
пиздеж = пиздёж = враньё = вранье = фалсе = False
хуй_тебе = ноне = нихуя = None

список = лист = газета = list
слово = базар = стринг = стр = str
бул = монетка = пацанская_правда = bool
цифра = цыфра = число = двоечка = инт = int
я_не_шарю_в_математике = флоат = float
сет = множество = педики = set
чудоюдо = обжект = объект = object
модулетупе = модуль_тупой = ModuleType

сказануть = принт = print
пацанский_метод = classmethod
спиздить = взять = input
открыть = вскрыть = open

@пацанская_функция
def импорт(кличка:стринг, глобалс=..., локалс=..., откуда=..., уровень:инт=0) -> модулетупе:
    return __import__(name=кличка,globals=глобалс,locals=локалс,fromlist=откуда, level=уровень)
заебнуть = __импорт__ = импорт

@пацанская_функция
def выйти(зачем:инт=...):
    return exit(зачем)
захлебнуться = умереть = сдохнуть = ексит = выйти